philipellisis/Arduino_Boards/clevsoft/avr/boards.txt
# Spark Board Contribution Configuration
#
# For more information see:
# * https://github.com/arduino/Arduino/wiki/Arduino-IDE-1.5---3rd-party-Hardware-specification
# * https://github.com/arduino/Arduino/wiki/Arduino-Hardware-Cores-migration-guide-from-1.0-to-1.6
#

menu.cpu=Processor



################################################################################
################################## Pro Micro ###################################
################################################################################
promicro.name=Clev Soft PinOne

promicro.upload.tool=avrdude
promicro.upload.protocol=avr109
promicro.upload.maximum_size=28672
promicro.upload.maximum_data_size=2560
promicro.upload.speed=57600
promicro.upload.disable_flushing=true
promicro.upload.use_1200bps_touch=true
promicro.upload.wait_for_upload_port=true

promicro.bootloader.tool=avrdude
promicro.bootloader.unlock_bits=0x3F
promicro.bootloader.lock_bits=0x2F
promicro.bootloader.low_fuses=0xFF
promicro.bootloader.high_fuses=0xD8

promicro.build.board=AVR_PROMICRO
promicro.build.core=arduino:arduino
promicro.build.variant=promicro
promicro.build.mcu=atmega32u4
promicro.build.usb_product="Clev Soft PinOne"
promicro.build.vid=0x0e8f
promicro.build.extra_flags={build.usb_flags}

############################# Pro Micro 5V / 16MHz #############################

promicro.build.pid.0=0x9205
promicro.build.pid.1=0x9206
promicro.build.pid=0x9206
promicro.build.f_cpu=16000000L

promicro.bootloader.extended_fuses=0xCB
promicro.bootloader.file=caterina/Caterina-promicro16.hex


